holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.h
    lv_obj_t * lbl_current_twilight_zone_name;
    lv_obj_t * val_current_twilight_zone_name;

    lv_obj_t * lbl_LMST_astronomical_twilight_dawn;
    lv_obj_t * val_LMST_astronomical_twilight_dawn;

    lv_obj_t * lbl_LMST_nautical_twilight_dawn;
    lv_obj_t * val_LMST_nautical_twilight_dawn;    

    lv_obj_t * lbl_LMST_civil_twilight_dawn;
    lv_obj_t * val_LMST_civil_twilight_dawn;

    lv_obj_t * lbl_LMST_sunrise;
    lv_obj_t * val_LMST_sunrise;

    lv_obj_t * lbl_LMST_golden_hour_dawn;
    lv_obj_t * val_LMST_golden_hour_dawn;

    lv_obj_t * lbl_LMST_FullDayLight;
    lv_obj_t * val_LMST_FullDayLight;

    lv_obj_t * lbl_LMST_golden_hour_dusk;
    lv_obj_t * val_LMST_golden_hour_dusk;

    lv_obj_t * lbl_LMST_sunset;
    lv_obj_t * val_LMST_sunset;

    lv_obj_t * lbl_LMST_civil_twilight_dusk;
    lv_obj_t * val_LMST_civil_twilight_dusk;

    lv_obj_t * lbl_LMST_nautical_twilight_dusk;
    lv_obj_t * val_LMST_nautical_twilight_dusk;

    lv_obj_t * lbl_LMST_astronomical_twilight_dusk;
    lv_obj_t * val_LMST_astronomical_twilight_dusk;
    
    lv_obj_t * lbl_LMST_astronomical_night;
    lv_obj_t * val_LMST_astronomical_night;

    // lv_obj_t * lbl_LMST_current_twilight_zone_name;
    // lv_obj_t * val_LMST_current_twilight_zone_name;
    // lv_obj_t * lbl_LMST_current_twilight_zone_start_time;
    // lv_obj_t * val_LMST_current_twilight_zone_start_time;
    // lv_obj_t * lbl_LMST_current_twilight_zone_end_time;
    // lv_obj_t * val_LMST_current_twilight_zone_end_time;

} satio_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief Gyro Container Struct
 */
typedef struct {
    lv_obj_t * panel;
    lv_obj_t * lbl_gyro_0_ang_x;
    lv_obj_t * val_gyro_0_ang_x;
    lv_obj_t * val_gyro_0_ang_y;
    lv_obj_t * val_gyro_0_ang_z;
    lv_obj_t * lbl_gyro_0_acc_x;
    lv_obj_t * val_gyro_0_acc_x;
    lv_obj_t * val_gyro_0_acc_y;
    lv_obj_t * val_gyro_0_acc_z;
    lv_obj_t * lbl_gyro_0_gyr_x;
    lv_obj_t * val_gyro_0_gyr_x;
    lv_obj_t * val_gyro_0_gyr_y;
    lv_obj_t * val_gyro_0_gyr_z;
    lv_obj_t * lbl_gyro_0_mag_x;
    lv_obj_t * val_gyro_0_mag_x;
    lv_obj_t * val_gyro_0_mag_y;
    lv_obj_t * val_gyro_0_mag_z;
    lv_obj_t * lbl_gyro_0_current_uiBaud;
    lv_obj_t * val_gyro_0_current_uiBaud;
} gyro_0_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief Serial Container Struct
 */
typedef struct {
    lv_obj_t * panel;

    lv_obj_t * lbl_title_output_all;
    lv_obj_t * lbl_title_output_gps;
    lv_obj_t * lbl_title_output_gyro;
    lv_obj_t * lbl_title_output_aux;
    lv_obj_t * lbl_title_output_uni;

    lv_obj_t * lbl_output_all;
    lv_obj_t * sw_output_all;

    lv_obj_t * lbl_output_satio;
    lv_obj_t * sw_output_satio;
    lv_obj_t * lbl_output_gngga;
    lv_obj_t * sw_output_gngga;
    lv_obj_t * lbl_output_gnrmc;
    lv_obj_t * sw_output_gnrmc;
    lv_obj_t * lbl_output_gpatt;
    lv_obj_t * sw_output_gpatt;
    lv_obj_t * lbl_output_ins;
    lv_obj_t * sw_output_ins;

    lv_obj_t * lbl_output_gyro_0;
    lv_obj_t * sw_output_gyro_0;

    lv_obj_t * lbl_output_matrix;
    lv_obj_t * sw_output_matrix;
    lv_obj_t * lbl_output_input_controller;
    lv_obj_t * sw_output_input_controller;
    lv_obj_t * lbl_output_admplex_0;
    lv_obj_t * sw_output_admplex_0;

    lv_obj_t * lbl_output_sun;
    lv_obj_t * sw_output_sun;
    lv_obj_t * lbl_output_mercury;
    lv_obj_t * sw_output_mercury;
    lv_obj_t * lbl_output_venus;
    lv_obj_t * sw_output_venus;
    lv_obj_t * lbl_output_earth;
    lv_obj_t * sw_output_earth;
    lv_obj_t * lbl_output_luna;
    lv_obj_t * sw_output_luna;
    lv_obj_t * lbl_output_mars;
    lv_obj_t * sw_output_mars;
    lv_obj_t * lbl_output_jupiter;
    lv_obj_t * sw_output_jupiter;
    lv_obj_t * lbl_output_saturn;
    lv_obj_t * sw_output_saturn;
    lv_obj_t * lbl_output_uranus;
    lv_obj_t * sw_output_uranus;
    lv_obj_t * lbl_output_neptune;
    lv_obj_t * sw_output_neptune;
    lv_obj_t * lbl_output_meteors;
    lv_obj_t * sw_output_meteors;
} serial_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief Analog/Digital Multiplexer Container Struct
 */
typedef struct {
    lv_obj_t * panel;

    lv_obj_t * lbl_title_chan_0;
    lv_obj_t * lbl_val_chan_0;
    
    lv_obj_t * lbl_title_chan_1;
    lv_obj_t * lbl_val_chan_1;
    
    lv_obj_t * lbl_title_chan_2;
    lv_obj_t * lbl_val_chan_2;
    
    lv_obj_t * lbl_title_chan_3;
    lv_obj_t * lbl_val_chan_3;
    
    lv_obj_t * lbl_title_chan_4;
    lv_obj_t * lbl_val_chan_4;
    
    lv_obj_t * lbl_title_chan_5;
    lv_obj_t * lbl_val_chan_5;
    
    lv_obj_t * lbl_title_chan_6;
    lv_obj_t * lbl_val_chan_6;
    
    lv_obj_t * lbl_title_chan_7;
    lv_obj_t * lbl_val_chan_7;
    
    lv_obj_t * lbl_title_chan_8;
    lv_obj_t * lbl_val_chan_8;
    
    lv_obj_t * lbl_title_chan_9;
    lv_obj_t * lbl_val_chan_9;
    
    lv_obj_t * lbl_title_chan_10;
    lv_obj_t * lbl_val_chan_10;
    
    lv_obj_t * lbl_title_chan_11;
    lv_obj_t * lbl_val_chan_11;
    
    lv_obj_t * lbl_title_chan_12;
    lv_obj_t * lbl_val_chan_12;
    
    lv_obj_t * lbl_title_chan_13;
    lv_obj_t * lbl_val_chan_13;
    
    lv_obj_t * lbl_title_chan_14;
    lv_obj_t * lbl_val_chan_14;
    
    lv_obj_t * lbl_title_chan_15;
    lv_obj_t * lbl_val_chan_15;

} admplex0_container_t;

/** ---------------------------------------------------------------------------------------
 * UAP Struct
 */
typedef struct {
    lv_obj_t * panel;

    lv_obj_t * radial_panel;

    lv_obj_t * roll_panel;

    lv_obj_t * pitch_panel;
    lv_obj_t * pitch_tape;
    int32_t pitch_tape_height_px;
    int32_t pitch_tape_content_height_px;
    lv_obj_t * pitch_center_marker_0;
    lv_obj_t * pitch_center_marker_1;

    lv_obj_t * gh_panel;
    lv_obj_t * gh_tape;
    int32_t gh_tape_width_px;
    int32_t gh_tape_content_width_px;
    lv_obj_t * gh_center_marker_0;
    lv_obj_t * gh_center_marker_1;
    
    lv_obj_t * latitude_label;
    lv_obj_t * longitude_label;

